Revit 2027 API
BuiltInFailures.AutoJoinFailures.OtherNonEditJoinFailure Property
 Two elements were not automatically joined because other elements at join are not editable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OtherNonEditJoinFailure { get; }
Public Shared ReadOnly Property OtherNonEditJoinFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OtherNonEditJoinFailure {
	FailureDefinitionId^ get ();
}
static member OtherNonEditJoinFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoJoinFailures Class
Autodesk.Revit.DB Namespace